## Time Methods

In [1]:
import pandas as pd

In [10]:
myser = pd.Series(['jan 3, 2010', '2010-jun-01'])

In [11]:
myser

0    jan 3, 2010
1    2010-jun-01
dtype: object

Converting dtype from object to datetime

In [12]:
pd.to_datetime(myser)

0   2010-01-03
1   2010-06-01
dtype: datetime64[ns]

### Custom Formatting

In [13]:
date='20---Jan---2010'

In [20]:
pd.to_datetime(date, format='%d---%b---%Y')

Timestamp('2010-01-20 00:00:00')

In [21]:
sales = pd.read_csv('RetailSales_BeerWineLiquor.csv')

In [22]:
sales.head()

         DATE  MRTSSM4453USN
0  1992-01-01           1509
1  1992-02-01           1541
2  1992-03-01           1597
3  1992-04-01           1675
4  1992-05-01           1822

In [29]:
type(sales['DATE'][0])

str

In [30]:
# Parse Column at Index 0 as Datetime
sales = pd.read_csv('RetailSales_BeerWineLiquor.csv',parse_dates=[0])

In [31]:
type(sales['DATE'][0])

pandas._libs.tslibs.timestamps.Timestamp

In [36]:
sales=sales.set_index('DATE')

In [38]:
sales.head()

            MRTSSM4453USN
DATE
1992-01-01           1509
1992-02-01           1541
1992-03-01           1597
1992-04-01           1675
1992-05-01           1822

In [45]:
sales.resample(rule='M').mean()

            MRTSSM4453USN
DATE
1992-01-31         1509.0
1992-02-29         1541.0
1992-03-31         1597.0
1992-04-30         1675.0
1992-05-31         1822.0
...                   ...
2019-12-31         6630.0
2020-01-31         4388.0
2020-02-29         4533.0
2020-03-31         5562.0
2020-04-30         5207.0

[340 rows x 1 columns]